{
  "nomeCorso": "Machine learning",
  "docente": "Giorgio Gambosi",
  "annoAccademico": "2015-2016",
  "crediti": "9",
  "settore": "INF/01",
  "anno": "2",
  "semestre": "2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [
    {
      "titolo": "Appello sessione invernale",
      "data": "29-01-2017 17:52",
      "contenuto": "L'appello di esame della sessione invernale avrà luogo martedì 28-2-2017 alle ore 14 nello studio del docente."
    },
    {
      "titolo": "",
      "data": "11-06-2016 14:39",
      "contenuto": "I materiali messi a disposizione degli studenti saranno accessibili alla seguentecartella dropbox(aprire il link in una diversa finestra)"
    },
    {
      "titolo": "Date esami sessione estiva",
      "data": "24-05-2016 22:11",
      "contenuto": "I due appelli di esame della sessione estiva avranno luogo, rispettivamente, venerdì 24-6 e lunedì 25-7, in entrambi i casi alle ore 10 nello studio del docente."
    },
    {
      "titolo": "",
      "data": "26-03-2016 11:25",
      "contenuto": "Si comunica che, successivamente alla pausa per la Pasqua, le lezioni riprenderanno venerdì 1 Aprile."
    },
    {
      "titolo": "",
      "data": "21-03-2016 14:17",
      "contenuto": "Per motivi di salute, la lezione di martedì 22 marzo è rimandata a data da definire. Le lezioni riprenderanno dopo le vacanze pasquali."
    },
    {
      "titolo": "",
      "data": "09-03-2016 18:33",
      "contenuto": "Nella cartella 'Libri', all'interno della cartella dropbox condivisa, sono disponibili alcuni testi di Machine learning e di programmazione Python liberamente disponibili su Internet"
    },
    {
      "titolo": "",
      "data": "09-03-2016 18:30",
      "contenuto": "All'indirizzo http://pybrain.org/ è disponibile la documentazione di PyBrain, package Python per la definizione di reti neurali"
    },
    {
      "titolo": "",
      "data": "09-03-2016 18:29",
      "contenuto": "All'indirizzo http://scikit-learn.org/stable/ è disponibile la documentazione di scikit-learn, package Python di machine learning"
    },
    {
      "titolo": "",
      "data": "09-03-2016 18:27",
      "contenuto": "All'indirizzo http://www.scipy-lectures.org/ sono disponibili tutorial sui package Numpy, Scipy, Matplotlib"
    },
    {
      "titolo": "",
      "data": "09-03-2016 18:25",
      "contenuto": "All'indirizzo https://www.continuum.io/downloads è disponibile l'ambiente di programmazione Python Anaconda: include l'editor Spyder"
    },
    {
      "titolo": "",
      "data": "09-03-2016 18:23",
      "contenuto": "All'indirizzo https://store.enthought.com/downloads è disponibile l'ambiente Enthought Canopy di programmazione Python: è prevista una academic license per docenti e studenti."
    },
    {
      "titolo": "",
      "data": "09-03-2016 18:18",
      "contenuto": "Al seguente indirizzo, documentazione sui package Pyhton Numpy, Scipy, Matplotlib, Pandase sull'ambiente IPython"
    }
  ],
  "lezioni": [
    {
      "id": "3",
      "data": "15-03-2016",
      "contenuto": "Cenni di statistica bayesiana. Distribuzioni coniugate. Esempi. Model fitting: maximum likelihood, maximum a posteriori. Modelli di previsione: approccio fully bayesian."
    },
    {
      "id": "2",
      "data": "09-03-2016",
      "contenuto": "Esempio di regressione polinomiale. Overfitting. Utilizzo di funzioni di penalità. Richiami di probabilità."
    },
    {
      "id": "1",
      "data": "08-03-2016",
      "contenuto": "Aspetti organizzativi del corso. Introduzione all'apprendimento automatico. Supervised e unsupervised learning."
    }
  ],
  "materiale": [],
  "programma": "Pattern recognition e machine learning. Schema generale di un sistema di ML. Inferenza. Apprendimento supervisionato e non supervisionato. Regressione lineare. Funzioni base e regressione. Overfitting e funzioni di penalizzazione. Model selection. Introduzione alla teoria delle decisioni. Classificazione: approcci (funzioni di discriminazione, modelli probabilistici discriminativi, modelli probabilistici generativi). Riduzione di dimensionalità e feature selection. Il modello connessionistico. Reti neurali a più strati. Apprendimento di reti neurali. Optimal margin classifiers e support vector machines. Funzioni kernel. Metodi non parametrici per la stima di probabilità: applicazione alla classificazione. Apprendimento non supervisionato. Clustering. Algoritmo k-means. Modelli di mistura di distribuzioni. Modelli a variabili latenti e algoritmo EM. Modello probabilistico di PCA. Factor analysis.Ensemble methods.Modelli statistici del testo. LSA, PLSA, Topic models. Utilizzo di strumenti in ambiente Python per l'analisi e l'apprendimento da dataset reali.",
  "testiRiferimento": "C. M. Bishop \"Pattern recognition and machine learning\", Springer",
  "ricevimento": "Al termine delle lezioni. E' possibile inoltre richiedere un appuntamento via mail.",
  "modalitàEsame": "Colloquio orale. E' previsto un progetto di applicazione di metodi di ML ad uno specifico problema e la redazione della relativa relazione. Per l'iscrizione all'esame è richiesta la prenotazione sul sito delphi.uniroma2.it"
}