{
  "nomeCorso": "Intelligenza artificiale",
  "docente": "Stefano De Luca",
  "annoAccademico": "2010-2011",
  "crediti": "6",
  "settore": "",
  "anno": "3",
  "semestre": "1",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "Introduzione all'AISemantic web e test di TuringCreare ontologie con Protégé; esempi di reasoning (DL)la description logic (teoria - no tableaux)La description logic - modelliIl calcolo del primordineSWRL con esempiDerivazione tramite tableauxSistemi a regole: JessSituation/Event calculus e il planninggrafi, depth/breadth first, A*Reti bayesiane: introReti bayesiane: esempiReti neurali, introReti neurali, jooneClustering: KNNClustering: SOMAlgoritmi geneticiSVM, introSVM, libsvmTemi di ricerca\nIl corso utilizzerà il semantic web come base per mostrare gli usi della logica nei sistemi intelligenti.\r\n \r\nObiettivi: Avere una visione di insieme dell'intelligenza artificiale, conoscerne le problematiche e le aree principali, saper usare gli strumenti della logica matematica per rappresentare la conoscenza e derivarne inferenze, avere una competenza pratica basilare del semantic web, compresa la creazione di ontologie e semplici reasoning e dei sistemi a regole, nonché una introduzione alle reti neuronali e agli algoritmi genetici.\r\n \r\nComplessivamente lo studente sarà in grado di progettare e implementare semplici componenti intelligenti di un agente.\r\n \r\n Esame:  \r\nL'esame consta di una parte scritta obbligatoria e una parte orale.  \r\nLo scritto è basato su esercizi e sulla descrizione della progettazione di un agente intelligente\r\nÈ previsto un esonero a metà corso; l?esonero sarà preceduto da una esercitazione\r\nPer superare l?esame, è necessario presentare un progetto su uno dei temi che verrà fornito. Il progetto (per 2..4 persone) è relativo alla messa in pratica di una delle tematiche trattate.\r\nChi vuole, può presentare una tesina su un argomento concordato.\r\nPer i non informatici: il progetto non è obbligatorio, eventualmente va sostituito dalla tesina.  \r\n\r\n I temi dell'esame sono quelli indicati nel programma e riportati in modo più analitico nella storia del corso (sotto indicata).\r\n \r\nLo studio degli articoli discussi in aula sarà considerato positivamente nella valutazione.\r\n\r\nStoria del corso\nN.LezioneArgomentoMateriale111/10Presentazione del corso; introduzione all'AI, sue applicazionislides 01215/10Gli agenti e gli agenti intelligenti; definizione astratta  di agenteDispense, prima parte319/10Pianificazione e ricerche, non informate (depth first, breadth first, iterative deepening) e con euristica  (greedy, A*)Dispense, seconda  parte422/10Giocare un gioco, algoritmo minimax, alpha-beta pruningSlides, dispense526/10Introduzione al semantic webSlides629/10Logica, calcolo proposizionaleTesti, capitolo sulla logica72/11Logica, calcolo proposizionale/2Testi, capitolo sulla logica85/11Calcolo dei predicati, metodo dei tableauxTesti, capitolo sulla logica; sito per provare il metodo dei tableaux: http://www.umsu.de/logik/trees/99/11Calcolo dei predicati, algoritmo di risoluzioneTesti, capitolo sulla logica: paragrafi §1.1, §1.2 (non §1.2.3, comunque consigliato), §1.3.1, opzionale §1.3.2, consigliato §1.4, fortemente consigliato §1.1012/11Introduzione al PrologSlides 04 Prolog, esempi nel materiale didattico1116/11Altri elementi di PrologSlides 05 Prolog, esempi nel materiale didattico1226/11Ontologie; introduzione ad OWL133/12Ontologie; introduzione alla description logic e il resoning147/12Description Logic e reasoningCapitolo nel materiale didattico. Paragrafi: §3.1, §3.2, §3.3.1, §3.4, opzionale ma consigliato §3.5, §3.7, §3.8157/12Logica: situation calculusSlides1614/12Esercitazione e ripasso1725/01Esonero1811/01Reti neurali, introduzione, reti feedforward e backprogragationSlides. Sito: http://www.willamette.edu/~gorr/classes/cs449/intro.html1914/01Scoprire i gruppi: tecniche di clustering. Lezione del dr. Francesco Uliana2018/01Clustering e semantica per text miningSlides2121/01Reti neurali, tecniche di addestramentoc.s.2225/01Esercitazione finale",
  "testiRiferimento": "Tutto il materiale del corso verrà distribuito sulla pagina del corso stesso\r\n\r\nVerranno fornite delle dispense e degli articoli su cui studiare (sempre in formato elettronico). A questi si accompagneranno dei capitoli, in formato zip e con password \"conoscenza\".\r\n\r\nDurante il corso, verranno proposte delle letture su temi attuali dell'IA; gli articoli verranno forniti in formato elettronico. È molto gradita la lettura di questi articoli, per poter poi avviare una discussione in classe (ultima parte della lezione di venerdì)\r\n\r\nDurante il corso si utilizzeranno due sofware:\r\n\r\nPer la creazione di ontologie: \r\nProtégé, http://protege.stanford.edu/\r\nPer il Prolog:\r\nSWI Prolog, http://www.swi-prolog.org/\r\n\r\nSono entrambi open source e free, e disponibili su più sistemi operativi.",
  "ricevimento": "Dopo lezione, su appuntamento",
  "modalitàEsame": "null"
}