{
  "nomeCorso": "Intelligenza artificiale",
  "docente": "Stefano De Luca",
  "annoAccademico": "2009-2010",
  "crediti": "6",
  "settore": "",
  "anno": "3",
  "semestre": "1",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "Introduzione all'AI\r\nSemantic web e test di Turing\r\nCreare ontologie con Protégé; esempi di reasoning (DL)\r\nLa description logic (teoria - no tableaux)\r\nLa description logic - modelli\r\nIl calcolo del primordine\r\nSWRL con esempi\r\nDerivazione tramite tableaux\r\nSistemi a regole: Jess\r\nSituation/Event calculus e il planning\r\ngrafi, depth/breadth first, A*\r\nReti bayesiane: intro\r\nReti bayesiane: esempi\r\nReti neurali, intro\r\nReti neurali, joone\r\nClustering: KNN\r\nClustering: SOM\r\nAlgoritmi genetici\r\nSVM, intro\r\nSVM, libsvm\r\nTemi di ricerca\r\nIl corso utilizzerà il semantic web come base per mostrare gli usi della logica nei sistemi intelligenti.\r\n\r\nObiettivi: Avere una visione di insieme dell'intelligenza artificiale, conoscerne le problematiche e le aree principali, saper usare gli strumenti della logica matematica per rappresentare la conoscenza e derivarne inferenze, avere una competenza pratica basilare del semantic web, compresa la creazione di ontologie e semplici reasoning e dei sistemi a regole, nonché una introduzione alle reti neuronali e agli algoritmi genetici.\r\n\r\nComplessivamente lo studente sarà in grado di progettare e implementare semplici componenti intelligenti di un agente.\r\n\r\nEsame: L'esame avrà una parte scritta ed una orale facoltativa, con cui lo studente potrà migliorare la prestazione scritta.\r\n\r\nOpzionalmente, vi sarà un esonero intermedio che consentirà di qualificarsi per la prima parte dello scritto. Lo scritto finale sarà comunque completo, per gli studenti che non avranno fatto (o desiderano ripetere) l'esonero - chi avrà fatto l'esonero non risponderà alla prima parte delle domande.\r\n\r\nI temi dell'esame sono quelli indicati nel programma e riportati in modo più analitico nella storia del corso (sotto indicata).\r\n\r\nIn modo facoltativo, sarà possibile produrre una tesina scritta su un argomento concordato con il professore, che consentirà di aumentare il voto fino a 3 punti, ad es. sulle logiche temporali, sulla tipologia delle reti neurali, sull'uso del modello biologico in AI etc.\r\n\r\nIn modo facoltativo, sarà possibile produrre un'esercitazione su un tema concordato con il professore, che consentirà di aumentare il voto fino a 3 punti. Ad es. apprendimento di un set di dati usando una rete neurale, applicazione di algoritmi genetici per risolvere un problema, creazione di un agente nel mondo del wumpus tramite il situation calculus.\r\n\r\nLo studio degli articoli discussi in aula sarà considerato positivamente nella valutazione.\r\n\r\nN.LezioneArgomentoMateriale129/09Presentazione del corso; introduzione all'AI, sue applicazionislides 0122/10Il semantic webslides 02, letture 1 e 236/10Le ontologieslides 3, testi 1 (Description logic), paragrafi: §3.1, §3.2, §3.3.1, §3.4, opzionale ma consigliato §3.5, §3.7, §3.849/10Le ontologie, uso della description logictesti 1 (Description logic)513/10La logica del primordine; i quantificatori; relazione con le ontologie e la description logic, esempi di uso; unione di più ontologie; i blank nodes e le relazioni n-arietesti 2: paragrafi §1.1, §1.2 (non §1.2.3, comunque consigliato), §1.3.1, opzionale §1.3.2, consigliato §1.4, fortemente consigliato §1.5;  slides 05616/10Logica; tavole di verità; interpretazioni e modelli; il metodo dei tableuxTesti 02; slides 06; sito per provare il metodo dei tableaux: http://www.umsu.de/logik/trees/720/10SPARQL; Linee guida per la creazione di un'ontologia - con esercitazioneSlides 04, slides 07823/10Scrivere applicazioni semantiche con il framework JenaSlides su Jena: http://www.try.idv.tw/try/files/070517-jena.ppt, tutorial sul sito di Jena: http://jena.sourceforge.net/ontology/; sito di Jena: http://jena.sourceforge.net/927/10Situation CalculusSlides 08, testi 031030/10Situation Calculus, discussione degli articoli sulla roboticaSlides 08, testi 03113/11Sistemi a regole, JessSlides 09, sito ufficiale di Jess: http://www.jessrules.com/126/11Sistemi a regole, Jess, esempi praticiSlides 09, sito ufficiale di Jess: http://www.jessrules.com/1317/11Problem solving e ricerca su grafi; algoritmi depth/breadth first; uso di euristiche: best first, greedy, A*Slides 10 e 11\n1420/11Giochi; giochi a somma zero; algoritmi di ricerca sui giochi: Minimax, Alpha-beta pruning. Euristiche per la valutazione delle posizioniSlides 12\n1523/11Reti di bayesTesti 04 - reti di bayes: §11.1, 11.2, 11.3 11.5, 11.6, slides 15, 15b\n1627/11Reti di bayes, inferenza con le reti bayesianec.s.172/12Esercitazione e review dei temi trattati185/12Esercitazione e review dei temi trattati191/12 Esercitazione e review dei temi trattati2015/12Esonero2118/12Algoritmi genetici, introduzioneslides 16\n228/01Algoritmi geneticislides 17",
  "testiRiferimento": "Verranno suggeriti alcuni capitoli scelti dal libro \"Handbook of Knowledge Representation\", eds. F.Van Harmelen, V.Lifschitz, B.Porter, Elsevier.\r\n\r\nVerranno inoltre indicati articoli.\r\n\r\nIl materiale è anche disponibile su questa pagina, in formato ZIP con password, da chiedere direttamente al professore.",
  "ricevimento": "Dopo le lezioni o su appuntamento. In ogni caso, inviare una mail a  s.deluca@evodevo.it.",
  "modalitàEsame": "null"
}