{
  "nomeCorso": "Analisi di reti",
  "docente": "Miriam Di Ianni",
  "annoAccademico": "2017-2018",
  "crediti": "6",
  "settore": "INF/01",
  "anno": "1",
  "semestre": "1",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [
    {
      "id": "24",
      "data": "17-01-2018",
      "contenuto": "Algoritmo di ricerca miope nell'anello, sua analisi nel caso q=0, cenni sul suo comportamento nel caso q=0 e discussione dei casi 0<q<1 e q>1. Considerazioni in supporto dell'ottimalità del modello q=dimensione dello spazio nel caso della griglia. (Cap 20, par. 20.7)"
    },
    {
      "id": "23",
      "data": "15-01-2018",
      "contenuto": "Il fenomeno small world: i sei gradi di separazione e il modello di Watts-Strogatz, la ricerca decentralizzata ed un modello per essa, analisi empirica dei modelli considrati, impatto della struttura centro-peroferia (cap. 20, par. 20.1-20.6)."
    },
    {
      "id": "22",
      "data": "18-12-2017",
      "contenuto": "Voto come forma di aggregazione dell'informazione. Voto non sincero. Giurie e regola dell'unanimità. Sistemi di voto in relazione alle cascate informative. (Cap. 23, par. 23.7-23.9)"
    },
    {
      "id": "21",
      "data": "13-12-2017",
      "contenuto": "Considerazioni su significato e portata del teorema di Arrow. Alternative ordinate, preferenze single peaked e teorema del votante mediano (cap 23, par. 23.6)."
    },
    {
      "id": "20",
      "data": "11-12-2017",
      "contenuto": "Il teorema di impossibilità di Arrow (cap. 23, par. 23.5 e 23.11)."
    },
    {
      "id": "19",
      "data": "06-12-2017",
      "contenuto": "Sistemi di voto. Espressione delle preferenze mediante relazioni binarie transitive e mediante ranking e loro equivalenza. Sistemi di voto a maggioranza e paradosso di Condorcet. Tornei e agende. Sistemi di voto posizionali e alternative irrilevanti. (Cap. 23, par. 23.1-23.4)"
    },
    {
      "id": "18",
      "data": "04-12-2017",
      "contenuto": "Un modello per la diffusione in presenza di compatibilità: il bilinguismo )par. 19.7 C).\nEstensione del modello base di diffusione:nodi eterogenei. Azione collettiva e conoscenza comune (cap. 19, par. 19.5, 19.6)."
    },
    {
      "id": "17",
      "data": "29-11-2017",
      "contenuto": "Capacità di cascata di una rete: catena, griglia, delimitazione inferione per topologie generiche (cap. 19, par. 19.7 A e B)."
    },
    {
      "id": "16",
      "data": "27-11-2017",
      "contenuto": "Processi di diffusione nelle reti. Modello di un processo di diffusione. Relazione fra cluster ed occorrenza delle cascate. Il ruolo dei weak ties. (Cap. 19, par. 19.1-19.4)"
    },
    {
      "id": "15",
      "data": "22-11-2017",
      "contenuto": "Analisi del modello Rich get richer (par. 18.7). Gli effetti dei motori di ricerca e i Recommendation Systems (par. 18.6)"
    },
    {
      "id": "14",
      "data": "20-11-2017",
      "contenuto": "Popolarità e fenomeno power law. Modelli Rich Get Richer. Impredicibilità degli effetti rich get richer. La lunga coda (cap. 18, par. 18.1-18.5)"
    },
    {
      "id": "13",
      "data": "15-11-2017",
      "contenuto": "Cascate informative: un semplice modello generale, relazioni fra decisioni sequenziali e insorgenza di cascate informative, considerazioni conclusive (cap. 16, par. 16.5-16.7)"
    },
    {
      "id": "12",
      "data": "13-11-2017",
      "contenuto": "Cascate informative: un semplice esperimento di herding e sua analisi (cap. 16, par. 16.1-16.4)"
    },
    {
      "id": "11",
      "data": "08-11-2017",
      "contenuto": "Ancora sul Page rank. Interpretazione del page rank in termini di random walk (cap. 14, par. 14.6).\nLa regola di Bayes applicata allo spam filtering (cap. 16, par. 16.3)"
    },
    {
      "id": "10",
      "data": "06-11-2017",
      "contenuto": "Termine della prova di convergenza del metodo Hubs and Authorities. Page Rank. Modern web search. (Cap. 14, par. 14.3, 14.4, 14.6)"
    },
    {
      "id": "9",
      "data": "30-10-2017",
      "contenuto": "Link analysis e ricerca sul web: il metodo Hubs and Authorities (Cap. 14, par. 14.1, 14.2, 14.6)"
    },
    {
      "id": "8",
      "data": "25-10-2017",
      "contenuto": "Bilanciamento debole: definizione e caratterizzazione (cap. 5, par. 5.4).\nLa struttura del web (cap. 13)."
    },
    {
      "id": "7",
      "data": "23-10-2017",
      "contenuto": "Grafi approssimativamente bilanciati (Cap. 5, Par. 5.5 B)"
    },
    {
      "id": "6",
      "data": "18-10-2017",
      "contenuto": "Caratterizzazazione del bilancio strutturale in grafi non completi (Cap. 5 Par. 5.5 A)"
    },
    {
      "id": "5",
      "data": "16-10-2017",
      "contenuto": "Omofilia, selezione e influenza sociale (cenni: par. 4.1 e 4.2).\nRelazioni positive e negative; bilancio strutturale in grafi completi: definizione e caratterizzazione. Bilancio strutturale in grafi non completi. (Cap 5, par. 5.1, 5.2)"
    },
    {
      "id": "4",
      "data": "11-10-2017",
      "contenuto": "Individuazioni di comunità: metodi divisivi e metoti agglonerativi; partizionamento gerarrchico. Il metodo di Girvan-Newman. (Par. 3.6)"
    },
    {
      "id": "3",
      "data": "09-10-2017",
      "contenuto": "Posizioni di nodi ed archi rispetto alle regioni coese di una rete e capitale sociale (par. 3.5). Prime definizioni di comunità: we-communities e cut-communities, loro relazione, complessità del partizionamento di un grafo in due web-communities (dispensa 1, in questa pagina)."
    },
    {
      "id": "2",
      "data": "04-10-2017",
      "contenuto": "Legami forti e deboli, bridge e local bridge, l'esperimento di Granovetter. Rilassamento del modello, esperimento di Onnela e coincidenza dei risultati sperimentali con le previsioni teoriche. Forza dei legami, social media e passive engagement. (Pag. 43-58)"
    },
    {
      "id": "1",
      "data": "02-10-2017",
      "contenuto": "Introduzione al corso (cap. 1 del testo). Grafi: percorsi, componenti connesse e fortemente connesse (cap. 2 del testo). Grafi aleatori. Il modello di Erdos-Renyi: grado medio, popolarità."
    }
  ],
  "materiale": [
    {
      "titolo": "Dispensa 1: web-communities e cut-communities",
      "dataUpload": "09.10.2017 16:36:45",
      "link": "http://www.informatica.uniroma2.it/upload/2017/AR/Communities.pdf",
      "dimensione": "103 KB"
    },
    {
      "titolo": "Dispensa 2: introduzione informale alla teoria della complessità (per gli studenti del CdL in Matematica)",
      "dataUpload": "09.10.2017 16:36:32",
      "link": "http://www.informatica.uniroma2.it/upload/2017/AR/IntroComplexity.pdf",
      "dimensione": "163 KB"
    }
  ],
  "programma": "Programma preventivato (che potrà subire variazioni nel corso di svolgimento delle lezioni):\n1) Teoria dei grafi e delle reti sociali.\n- Grafi, percorsi, connettività, distanza, ricerca\n- Chiusura triadica, importanza dei collegamenti deboli, struttura di rete in insiemi di grandi dimensioni,\n- indici di centralità e partizionamenti\n- Bilancio strutturale\n2)Dinamiche nelle reti: modelli di popolazione.\n- Cascate informative: il concetto \"segui la massa\", un modello di cascata, la regola di Bayes e le cascate\n- Effetti rete: economia con e senza gli effetti rete, il problema di El Farol Bar\n- Power Law e fenomeno rich-get-richer: la popolarità come un effetto rete, modelli rich-get-richer e la long tail\n3)Dinamiche nelle reti: modelli strutturali.\n- Comportamento a cascata: diffusione, cascate e cluster, il ruolo dei weak ties, capacità di una cascata\n- Il fenomeno Small-world: i sei gradi di separazione, modelli per lo Small-world; ricerca decentralizzata: modelli e analisi\n4) Reti di Informazione: il World Wide Web\n- Struttura del Web: reti di informazione, ipertesti e memoria associativa\n- Link analysis e ricerca nel Web: il problema del Ranking, Hubs e Authorities, il PageRank\n5) Istituzioni e comportamento aggregato\n- Meccanismi di voto: decisioni di gruppo e preferenze individuali; sistemi di voto a maggioranza e posizionale; Teorema di impossibilità di Arrow; Teorema del Voto Mediano\n- Voto come forma di aggregazione dell'informazione: voto sincero e non sincero, la regolaa dell'unanimità e il problema del verdetto della giuria; voto sequenziale e cascate informative.",
  "testiRiferimento": "David Easley, Jon Kleinberg, \"Networks, Crowds, and Markets: Reasoning about a Highly Connected World\", Cambridge University Press",
  "ricevimento": "Per appuntamento, da richiedere a mezzo posta elettronica",
  "modalitàEsame": "Prova orale eventualmente corredata da tesine"
}