{
  "nomeCorso": "Geometria ed algebra",
  "docente": "Franco Ghione",
  "annoAccademico": "2014-2015",
  "crediti": "6",
  "settore": "MAT/03",
  "anno": "1",
  "semestre": "2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "Geometria e Algebra\n\nCorso di Laurea Triennale in Informatica\n\nProf. Franco Ghione\n\na.a. 2014/2015\n\n\n\nProgramma\n\nAlgebra lineare ( I° parte )\n\n·Lo spazio dei vettori numerici reali acomponenti\n\nDefinizione, combinazioni lineari, indipendenza e dipendenza lineare.\n\n·L’algebra delle matrici reali\n\nIl linguaggio delle matrici e le principali operazioni (somma, prodotto, matrice trasposta, inversa, triangolare).\n\nMetodo di eliminazione di Gauss (per righe) eriduzione a scala di una matrice.\n\n·Sistemi di equazioni lineari omogenei e non omogenei\n\nRisoluzione con l’algoritmo di Gauss.\n\n·Determinanti\n\nMetodo di Laplace (per righe e per colonne), proprietà, calcolo del determinante con il metodo di eliminazione di Gauss, relazione tra l’annullamento del determinante di una matrice quadrata e la dipendenza lineare delle righe (o delle colonne), matrice inversa, calcolo dell’inversa con l’algoritmo di Gauss. La regola di Kramer\n\nAlgebra lineare ( II° parte )\n\n·Spazi vettoriali sul campo reale e suF2.\n\n·Sottospazio vettoriali\n\n·Basi e dimensione di uno spazio vettoriale.\n\n·Intersezione e somma di due sottospazi vettoriali.\n\nFormula di Grassmann\n\n·Matrici e applicazioni lineari\n\nNucleo, Immagine, teorema principale.\n\nIl codice di Hamming.\n\nGeometria analitica\n\n·Lo spazio vettoriale dei vettori geometrici\n\nInterpretazione geometrica delle operazioni di somma e prodotto per uno scalare. Interpretazione geometrica della dipendenza e indipendenza lineare di vettori geometrici,\n\nProdotto scalare di due vettori geometrici. Basi ortonormali dello spazio dei vettori geometrici.\n\nProdotto scalare in Rn e formula di Shwartz.\n\n·Sistemi di coordinate cartesiane nello spazio.\n\nEquazioni parametriche e cartesiane di un piano. Equazioni parametriche di una retta. Relazioni di parallelismo e perpendicolarità tra rette e piani.\n\nObiettivi formativi\n\n·Riconoscere e risolvere in modo algoritmico un sistema di equazioni lineari.\n\n·Conoscere le basi del calcolo matriciale\n\n·Conoscere i concetti fondamentali sugli spazi vettoriali e sulle applicazioni lineari anche su campi finiti.\n\n·Conoscere le applicazioni dell’algebra lineare alla geometria analitica dello spazio: rette, piani e loro relazioni.\n\nTesti consigliati\n\n·S.Lang, Algebra lineare, ed. Boringhieri\n\n·Note del corso di Geometria I del prof. Giambattista Marini, reperibili al sito\n\nhttp://www.mat.uniroma2.it/~marini/amg.pdf\n\n(Altre dispense di Algebra lineare si possono trovare in rete e sono essenzialmente equivalenti)\n\n·Esercizi di Geometria e Algebra lineare, reperibili ai siti\n\nhttp://www.dm.unito.it/quadernididattici/abbena/nuovo01.pdf\n\nhttp://www.dmf.unisalento.it/~calvaruso/Homepage/pages/esercizi.pdf\n\n\n\n\n\nModalità di accertamento\n\n·Esame scritto composto da 5 domande a risposta multipla e un tema.\n\n·Colloquio orale di discussione sull’elaborato scritto.",
  "testiRiferimento": "null",
  "ricevimento": "null",
  "modalitàEsame": "null"
}