{
  "nomeCorso": "Intelligenza artificiale",
  "docente": "Stefano De Luca",
  "annoAccademico": "2011-2012",
  "crediti": "6",
  "settore": "INF/01",
  "anno": "3",
  "semestre": "1",
  "propedeuticità": "Programmazione dei calcolatori con laboratorio.",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "Introduzione all'AISemantic web e test di TuringCreare ontologie con Protégé; esempi di reasoning (DL)la description logic (teoria - no tableaux)La description logic - modelliIl calcolo del primordineSWRL con esempiDerivazione tramite tableauxSistemi a regole: JessSituation/Event calculus e il planninggrafi, depth/breadth first, A*Reti bayesiane: introReti bayesiane: esempiReti neurali, introReti neurali, jooneClustering: KNNClustering: SOMAlgoritmi geneticiSVM, introSVM, libsvmTemi di ricercaIl corso utilizzerà il semantic web come base per mostrare gli usi della logica nei sistemi intelligenti.\r Obiettivi: Avere una visione di insieme dell'intelligenza artificiale, conoscerne le problematiche e le aree principali, saper usare gli strumenti della logica matematica per rappresentare la conoscenza e derivarne inferenze, avere una competenza pratica basilare del semantic web, compresa la creazione di ontologie e semplici reasoning e dei sistemi a regole, nonché una introduzione alle reti neuronali e agli algoritmi genetici.\r Complessivamente lo studente sarà in grado di progettare e implementare semplici componenti intelligenti di un agente.\r  Esame: L'esame consta di una parte scritta obbligatoria e una parte orale.  \rLo scritto è basato su esercizi e sulla descrizione della progettazione di un agente intelligente\rÈ previsto un esonero a metà corso; l?esonero sarà preceduto da una esercitazione\rPer superare l?esame, è necessario presentare un progetto su uno dei temi che verrà fornito. Il progetto (per 2..4 persone) è relativo alla messa in pratica di una delle tematiche trattate.\rChi vuole, può presentare una tesina su un argomento concordato.\rPer i non informatici: il progetto non è obbligatorio, eventualmente va sostituito dalla tesina.  \r  I temi dell'esame sono quelli indicati nel programma e riportati in modo più analitico nella storia del corso (sotto indicata).\r Lo studio degli articoli discussi in aula sarà considerato positivamente nella valutazione.\r N.LezioneArgomentoMateriale13/10Presentazione del corso; introduzione all'AI, sue applicazionislides 0127/10Problem solving. Come analizzare la soluzione di un problema tramite rappresentazione a grafo. Lettura su Test di Turingslides 02, Test di Turing e giochi310/10Cos'è un agente.  Definizione di agente.Dispense 00414/10Gli agenti e i sistemi di agenti. Sequenze di esecuzione. Agenti reattivi e agenti deliberativi./td>Dispense 00517/10Problem solving. Ricerche informate. Algoritmo A* ed euristica.slides 02n24/10I giochi. Ricerche sui giochi. Algoritmo Minimax e algoritmo Alpha-beta pruningslides 03628/10Introduzione al Semantic web. \rLettura \"\"Emotional Input for Character-based Interactive Storytelling\"\"slides 04. Lettura citata74/11Ontologie: Protégé: creare classi, superclassi e proprietà. \rLettura \"Using Technology and Innovation to Simulate Daily Life\"Tutorial di Protégé sulle ontologie: http://protege.stanford.edu/publications/ontology_development/ontology101.html.\rUn tutorial più completo e più lungo, basato sull'attuale versione di Protégé (ver. 4) è disponibile alla URL: http://owl.cs.manchester.ac.uk/tutorials/protegeowltutorial/. Lettura citata.87/11Ontologie: Protégé. Le classi equivalenti. Uso di un reasoner. Elementi di Description logic.Capitolo nel materiale didattico su Description Logic (password \"conoscenza\"). Paragrafi: §3.1, §3.2, §3.3.1, §3.4, opzionale ma consigliato §3.5, §3.7, §3.8911/11Il problema dell'identità e della similitudine nelle ontologie. Tecniche per calcolarle: distanza semantica, distanza di Jaccard.  Lettura \"\"An Integrated Environmental Decisional Support System Framework using Earth Observation, Cellular Automata and Multi-Agent System\"Lettura 06 sulla similarità semantica. \rLettura citata1018/11Il problema dell'identità e della similitudine nelle ontologie. Tecniche per calcolarle: distanza semantica, distanza di Jaccard.  Lettura \"\"An Integrated Environmental Decisional Support System Framework using Earth Observation, Cellular Automata and Multi-Agent System\"Lettura 06 sulla similarità semantica. \rLettura citata1121/11SPARQL e ricerche nel semantic web. Ricerche su dbpediaSlides SPARQL1225/11Algoritmi evolutivi e algoritmi geneticiSlides GAa1328/11Creazione di un'ontologia, review completa ed esercitazioneSlides \"come fare un'ontologia\"142/12Introduzione al Machine learning. Discussione sull'articolo \"Games with a Purpose for the Semantic Web\"Articolo citato.1517/12Tecniche di machine learning.1619/12Le reti bayesiane. Teorema di Bayes. Le inferenze probabilistiche.Capitolo sulle reti bayesiane.179/1Creare una rete bayesiana su casi reali. Creare una rete bayesiana in WekaWeka: http://www.cs.waikato.ac.nz/ml/weka/1813/1Introduzione alle Reti neurali. Il passaggio da  neurone naturale ad artificiale; il percettrone; le reti feedward; l'apprendimento tramite back-propagationcapitolo di Stefano Nolfi alla URL: http://www.sci.unich.it/~aroli/dida/iasc/articoli/Nolfi-RetiNeurali.pdf1916/1Reti neurali, creazione di una rete e ottimizzazione dei parametri. Creare una rete neurale in WekaWeka: http://www.cs.waikato.ac.nz/ml/weka/2020/1Tecniche di clustering. Algoritmo K-Means. Creare clusters in WekaWeka: http://www.cs.waikato.ac.nz/ml/weka/ 2123/1Classificazione di testi; esercitazione con Weka.Tutorial nel materiale didattico (materiale 05); dati di esempio (materiale 05) 2227/1Conclusione del corso. I progetti pro-esameElenco progetti",
  "testiRiferimento": "Tutto il materiale del corso verrà distribuito sulla pagina del corso stesso\r Verranno fornite delle dispense e degli articoli su cui studiare (sempre in formato elettronico). A questi si accompagneranno dei capitoli, in formato zip e con password \"conoscenza\".\r Durante il corso, verranno proposte delle letture su temi attuali dell'IA; gli articoli verranno forniti in formato elettronico. È molto gradita la lettura di questi articoli, per poter poi avviare una discussione in classe (ultima parte della lezione di venerdì)\r Durante il corso si utilizzerà il software Protégé, per la creazione di ontologie: \rProtégé, http://protege.stanford.edu/  E'  open source e free, e disponibile su più sistemi operativi.",
  "ricevimento": "Dopo lezione, su appuntamento",
  "modalitàEsame": "null"
}