{
  "nomeCorso": "Calcolo delle probabilità",
  "docente": "Antonella Calzolari",
  "annoAccademico": "2018-2019",
  "crediti": "6",
  "settore": "MAT/06",
  "anno": "1",
  "semestre": "2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [
    {
      "titolo": "",
      "data": "13-06-2019 10:20",
      "contenuto": "La lezione del 4 giugno è stata rimessa 30 minuti per volta nelle lezioni del 5, 11, 12 giugno.\n\nPer motivi di salute non farò lezione oggi, 4 giugno.\nNon ci sarà lezione il 23 e il 24 aprile.\n\nIl giorno martedì 2 aprile, per motivi di utilizzo da parte del Dipartimento di Matematica, la lezione in Bilblioteca storica dovrà terminare 10 minuti prima delle 13. Inizieremo comunque precisi alle 11 e 30 e recuperemo la volta successiva.\n\nPer gli esercizi assegnati a casa vedi\nhttp://www.mat.uniroma2.it/~calzolar/corso_CPinf1819.html\n\nFermo restando il mercoledì alle 14 in aula 6 PP2,invece del giovedì, insegnerò di martedì dalle 11.30 alle 13.30.Non essendo disponibile la 6 in PP2, il martedì insegnerò nell'aula dellaBiblioteca storica del Dipartimento di Matematica (aula 1200, piano 1, all'altezza più o meno del secondo dente) (a partire dal 19 marzo).\n\nPer motivi di sovrapposizione di orario, in accordo con la classe, la lezione di giovedì 14 marzo è stata rinviata a martedì 19 marzo dalle 11.30 alle 13.30, in aula da comunicare. Lo spostamento da giovedì a martedì sarà a breve confermato anche per il seguito."
    }
  ],
  "lezioni": [
    {
      "id": "23",
      "data": "12-06-2019",
      "contenuto": "Calcolo della funzione di transizione per la coda M/M/infinito e del suo limite al divergere del tempo.\n\nCorrezione esercizi i) e ii) del III e IV appello del 2017/2018"
    },
    {
      "id": "22",
      "data": "11-06-2019",
      "contenuto": "Catene di branching.\nCode markoviane a tempo continuo: M/M/infinito e M/M/N.\n\nCorrezione esercizi i) e ii) del II appello del 2017/2018"
    },
    {
      "id": "21",
      "data": "05-06-2019",
      "contenuto": "Equazione di Kolomogorov all'avanti.\nCatene di Markov a tempo continuo di nascita e morte.\nCalcolo della funzione di transizione per le catene di pura nascita.\n\nCorrezione esercizi i) e ii) del I appello del  2017/2018"
    },
    {
      "id": "20",
      "data": "29-05-2019",
      "contenuto": "Proprietà della matrice Q.\nDimostrazione di una prima equazione differenziale soddisfatta dalla funzione di transizione.\nCalcolo della funzione di transizione nel caso a due stati."
    },
    {
      "id": "19",
      "data": "28-05-2019",
      "contenuto": "Enunciato della perdita di memoria in tempo continuo.\nDimostrazione del fatto che la perdita di memoria implica che i tempi di permanenza negli stati siano esponenziali.\nMatrice dei parametri infinitesimali, Q: un nuovo insieme di parametri per descrivere una dinamica markoviana in tempo continuo.\nIl caso a due stati.\nProprietà della matrice Q.\nDimostrazione di una prima equazione differenziale soddisfatta dalla funzione di transizione.\nCalcolo della funzione di transizione nel caso a due stati."
    },
    {
      "id": "18",
      "data": "22-05-2019",
      "contenuto": "Verifica della legge del k-mo tempo di salto di un processo di Poisson che compie n salti entro il tempo T.\nDinamica markoviana a tempo continuo in uno spazio discreto: i parametri che la descrivono."
    },
    {
      "id": "17",
      "data": "21-05-2019",
      "contenuto": "Calcolo della legge in un tempo fissato del processo di Poisson non stazionario.\nLegge dei tempi di salto di un processo di Poisson condizionata al numero degli eventi fino ad un tempo fissato (senza dimostrazione) e applicazione al calcolo del costo di attesa."
    },
    {
      "id": "16",
      "data": "15-05-2019",
      "contenuto": "Splitting di un processo di Poisson. Coda con infiniti sportelli con tempo di servizio a duevalori e flusso di ingresso Poisson. Processo di Poisson composto: definizione e media in un tempo fissato. Richiamo di analisi: problema di Cauchy del I ordine lineare."
    },
    {
      "id": "15",
      "data": "14-05-2019",
      "contenuto": "Il processo di Poisson come modello per un flusso di eventi \"rari\". Somma di due processi di Poisson indipendenti (merging). Problema della scorta."
    },
    {
      "id": "14",
      "data": "08-05-2019",
      "contenuto": "Probabilità che una variabile esponenziale sia più piccola di un'altra esponenziale ed indipendente. Indipendenza degli incrementi del processo di Poisson e loro legge. Problema della multa."
    },
    {
      "id": "13",
      "data": "07-05-2019",
      "contenuto": "Definizione del processo di Poisson, calcolo della funzione di distribuzione di una gamma e calcolo della legge del processo di Poisson in un tempo generico, perdita di memoria del processo di Poisson."
    },
    {
      "id": "12",
      "data": "30-04-2019",
      "contenuto": "Definizione di ergodicità. Se una catena è ergodica esiste ed è unica la misura invariante.\nDefinizione di periodo di uno stato e dimostrazione della sua unicità in una catena irriducibile.\nCondizione necessaria e sufficiente per l'ergodicità per le catene irriducibili persistenti positive.\nRegolarità di una dinamica irriducibile a stati finiti.\nEsercizio 4 delle Note."
    },
    {
      "id": "11",
      "data": "17-04-2019",
      "contenuto": "Esercizio 12 e Esercizio 13 delle Note.\nMisure stazionarie: caso catena irriducibile persistente positiva, caso irriducibile a stati finiti, caso nascita e morte irriducibile.\nEsercizio 14 delle Note."
    },
    {
      "id": "10",
      "data": "16-04-2019",
      "contenuto": "Comportamento asintotico della catena a 2 stati.\nMisure stazionarie: definizione, caso dinamica bistocastica, nessuna, una o infinite, valore sugli stati transienti (da cui segue che l'esistenza di almeno uno stato persistente è CN per l'esistenza)."
    },
    {
      "id": "9",
      "data": "10-04-2019",
      "contenuto": "Probabilità di estinzione per la catena di nascita e morte con estremi assorbenti.\nCatena del giocatore e probabilità di rovina.\nPersistenza e transienza di una catena di nascita e morte con infiniti stati."
    },
    {
      "id": "8",
      "data": "09-04-2019",
      "contenuto": "Correzione esercizio e sue varianti.\nProbabilità di assorbimento.\nTempo medio di assorbimento nella classe di tutti gli stati persistenti in una catena a stati finiti."
    },
    {
      "id": "7",
      "data": "03-04-2019",
      "contenuto": "La probabilità di raggiungere in k passi un qualsiasi stato transiente va a zero quando k diverge.\nEsistenza di almeno uno stato persistente quando lo spazio degli stati è finito.\nCondizione sufficiente per la transienza di uno stato.\nCondizione sufficiente per la persistenza di uno stato.\nGli stati delle classi irriducibili finite sono persistenti.\nLa classe irriducibile che contiene uno stato persistente e tutti gli stati che con esso comunicano.\nDecomposizione dello spazio degli stati.\nNel caso stati finiti, condizione necessaria affinché uno stato sia transiente.\nUscita certa dalla classe degli stati transienti nel caso questa sia finita.\nEsempi di decomposizione dello spazio degli stati."
    },
    {
      "id": "6",
      "data": "02-04-2019",
      "contenuto": "Correzione esercizio.\nLegge del numero totale di visite ad uno stato.\nValor medio del numero totale di visite ad uno stato transiente."
    },
    {
      "id": "5",
      "data": "27-03-2019",
      "contenuto": "Stati comunicanti e classi irriducibili.\nDefinizione di transienza e persistenza di uno stato.\nLemma di continuità della misura di probabilità.\nTeorema degli infiniti ritorni."
    },
    {
      "id": "4",
      "data": "26-03-2019",
      "contenuto": "Probabilità di transizione in n passi e legge al tempo n.\nCatene di nascita e morte: catena della rovina del giocatore e catena di Ehrenfest."
    },
    {
      "id": "3",
      "data": "20-03-2019",
      "contenuto": "Richiami su probabilità condizionata di eventi, formula del prodotto e indipendenza di famiglie di eventi e variabili aleatorie.\nDefinizione di Catena di Markov a tempo discreto e spazio discreto.\nPasseggiata aleatoria sugli interi in forma ricorsiva."
    },
    {
      "id": "2",
      "data": "19-03-2019",
      "contenuto": "II test di autovalutazione con correzione"
    },
    {
      "id": "1",
      "data": "13-03-2019",
      "contenuto": "I test di autovalutazione con correzione"
    }
  ],
  "materiale": [],
  "programma": "Catene di Markov a tempo discreto e a stati numerabili.\nProcesso di Poisson.\nElementi della teoria dei processi di rinnovo.\nCatene di Markov a tempo continuo.",
  "testiRiferimento": "A.Calzolari, \"Modelli stocastici a valori discreti, Note del corso di CP per la LM in Informatica\" da scaricare da\nhttp://www.mat.uniroma2.it/~calzolar/corso_CPinf1819.html\n\nH.C.Tijms, \"A First Course in Stochastic Models\"\n\nP.Baldi, \"Calcolo delle probabilità\"",
  "ricevimento": "Per appuntamento in studio",
  "modalitàEsame": "Esame scritto in due moduli affrontabili in una sola prova o in due prove separate e con voto che si conserva per tutto l'anno accademico. Il primo modulo consiste in uno  o più esercizi sulle catene di Markov a tempo discreto, mentre il secondo modulo sostituisce una prova orale e quindi propone quesiti sulla rimanente parte del programma ai quali occorre rispondere in modo discorsivo ma rigoroso. Il voto finale è la media dei due voti. Ad ogni appello vengono proposti entrambi i moduli e il tempo assegnato e' 2 ore.\nIn accordo con il regolamento del corso di laurea, lo studente potrà accedere a 4 dei 6 appelli proposti (2 appelli per ogni sessione) ma ad uno solo nelle sessioni autunnali e invernali (attenzione: DIVERSAMENTE da quanto detto durante la prima lezione, la regola dei 4 appelli è complessiva sui due moduli).\nCiascun modulo si può ripetere al massimo due volte."
}