{
  "nomeCorso": "Analisi Matematica",
  "docente": "Florin Radulescu",
  "annoAccademico": "2016-2017",
  "crediti": "9",
  "settore": "MAT/05",
  "anno": "1",
  "semestre": "1",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "PROGRAMMA DEL CORSO:\n\nIl testo consigliato e:\n\nMatematica, Bramanti, Pagani, Salsa  ed. Zanichelli\n\nLa programma del corso e;\n\nINSIEMI NUMERICI\nInsiemi, numeri naturali, interi, razionali, principio di induzione, progressione geometrica,  binomio di Newton, gli\nassiomi dei numeri reali, massimo e minimo, estremo inferiore ed estremo superiore. Funzioni e rappresentazione\ncartesiana, funzioni iniettive, suriettive, biettive, funzioni composte, funzioni invertibili, monotone, lineari,\nsimmetriche, periodiche, limitate. Estremo superiore, estremo inferiore, massimo e minimo di una funzione. Funzione\nvalore assoluto, potenze, radicali, esponenziali, logaritmi, funzioni iperboliche, funzioni trigonometriche. Operazioni\nsui grafici.\n\nSUCCESSIONI\nIntroduzione al calcolo infinitesimale, successioni, limiti di successioni, teorema di unicità del limite, successioni\nlimitate, operazioni con i limiti, teorema della permanenza del segno e conseguenze, teorema dei carabinieri,\nsuccessioni infinitesime, teorema sul limite del prodotto di successioni limitate per successioni convergenti. Forme\nindeterminate. Successioni monotone, teorema sul limite di successioni monotone, limiti notevoli, confronti e stime\nasintotiche, infiniti di ordine crescente, criterio del rapporto per successioni(s.d.).\n\nSERIE\nCriteri di convergenza: Raporto, Radice, Leibniz. La seria armonica\n\nFUNZIONI DI UNA VARIABILE: LIMITI E CONTINUITA'\nDefinizione di limite nei diversi casi, teorema sul legame tra limiti di successioni e limiti di funzioni, limiti notevoli,\noperazioni con i limiti di funzioni. Funzioni continue, discontinuità, teorema sulla permanenza del segno, teorema degli\nzeri, teorema di valori intermedi,\n\nCALCOLO DIFFERENZIALE PER FUNZIONI DI UNA VARIABILE\nDerivata di una funzione, significato geometrico, equazione della retta tangente, derivate di funzioni elementari, punti\ndi non derivabilità, operazioni con le derivate, teorema di derivazione delle funzioni composte e delle funzioni inverse.\nDifferenziale e approssimazione lineare. Punti stazionari, massimi e minimi locali, teorema di Fermat, teoremi di Rolle\ne di Lagrange, criterio di monotonia, teorema di caratterizzazione delle funzioni costanti su un intervallo. Ricerca dei\nmassimi e minimi. funzioni concave e funzioni convesse, criterio di convessità per funzioni derivabili (s.d.). Teorema di\nDe L'Hospital (s.d.). Studio del grafico di una funzione.Sviluppo Taylor\n\nCALCOLO INTEGRALE PER FUNZIONI  DI UNA VARIABILE\nIl metodo di esaustione, introduzione all'integrazione secondo Riemann: definizioni e notazioni, proprietà delle somme\nintegrali,  definizione di integrale definito, criterio di integrabilità(s.d.), proprietà dell'integrale definito, integrabilità\ndelle funzioni continue e delle funzioni monotone(s.d.), teorema della media integrale. Integrale indefinito, definizione\ndi primitiva, caratterizzazione delle primitive di una funzione in un intervallo, la funzione integrale,  primo e secondo\nteorema fondamentale del calcolo integrale, metodi elementari per la ricerca di una primitiva,  calcolo di integrali\ndefiniti e indefiniti,  integrazione per parti e per sostituzione, integrazione di funzioni razionali fratte, integrazione di\nfunzioni irrazionali. Applicazioni geometriche dell'integrale definito.Integrali impropri. Lunghezza di una curve\n\nEQUAZIONI DIFFERENZIALI\n\n1) Equazioni quasilineari del primo ordine. Caratteristiche, metodi di\nintegrazione. Caratteristiche e classi_cazione di equazioni del secondo ordine Nomenclatura sulle equazioni differenziali. Equazionidel primo ordine: a variabili separabili e lineari. Struttura delle soluzioni di un’equazione lineare di ordine n. Equazionidifferenziali lineari a coefficienti costanti (dim per II ordine caso _ > 0 e _ = 0). Equazioni non omogenee: metodo della variazione dei parametri e dei coefficienti indeterminati.",
  "testiRiferimento": "Matematica,   Calcolo infinitesimale e algebra lineare,Bramanti, Pagani, Salsa  ed. Zanichelli",
  "ricevimento": "Mercoledi 12-14 o per apuntamento via email",
  "modalitàEsame": "Scritto/Orale Esoneri"
}